Lex Plan for AS Staging

Terraform will perform the following actions:

  # module.lex["en"].aws_lex_bot.this["pre_survey"] will be created
  + resource "aws_lex_bot" "this" {
      + arn                             = (known after apply)
      + checksum                        = (known after apply)
      + child_directed                  = true
      + create_version                  = false
      + created_date                    = (known after apply)
      + description                     = "General configs/lex/en/bots Pre Survey bot"
      + detect_sentiment                = false
      + enable_model_improvements       = true
      + failure_reason                  = (known after apply)
      + id                              = (known after apply)
      + idle_session_ttl_in_seconds     = 600
      + last_updated_date               = (known after apply)
      + locale                          = "en-US"
      + name                            = "staging_as_en_pre_survey"
      + nlu_intent_confidence_threshold = 0
      + process_behavior                = "BUILD"
      + status                          = (known after apply)
      + version                         = (known after apply)
      + voice_id                        = (known after apply)

      + abort_statement {
          + message {
              + content      = "Sorry, I am not able to assist at this time."
              + content_type = "PlainText"
            }
        }

      + clarification_prompt {
          + max_attempts = 2

          + message {
              + content      = <<-EOT
                    Sorry, I didn't understand that. Please try again. 
                    Please answer the questions.
                EOT
              + content_type = "PlainText"
            }
        }

      + intent {
          + intent_name    = "staging_as_en_pre_survey"
          + intent_version = (known after apply)
        }
    }

  # module.lex["en"].aws_lex_bot_alias.this["pre_survey"] will be created
  + resource "aws_lex_bot_alias" "this" {
      + arn               = (known after apply)
      + bot_name          = "staging_as_en_pre_survey"
      + bot_version       = "$LATEST"
      + checksum          = (known after apply)
      + created_date      = (known after apply)
      + description       = "Bot alias for staging_as_en_pre_survey"
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "latest"
    }

  # module.lex["en"].aws_lex_intent.this["pre_survey"] will be created
  + resource "aws_lex_intent" "this" {
      + arn               = (known after apply)
      + checksum          = (known after apply)
      + create_version    = false
      + created_date      = (known after apply)
      + description       = "Survey intent"
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "staging_as_en_pre_survey"
      + sample_utterances = [
          + "Incoming webchat contact",
          + "trigger_pre_survey",
        ]
      + version           = (known after apply)

      + conclusion_statement {
          + message {
              + content      = "We'll transfer you now. Please hold for a counsellor."
              + content_type = "PlainText"
            }
        }

      + fulfillment_activity {
          + type = "ReturnIntent"
        }

      + slot {
          + description       = "Age of caller"
          + name              = "age"
          + priority          = 2
          + sample_utterances = []
          + slot_constraint   = "Required"
          + slot_type         = "staging_as_en_age"
          + slot_type_version = (known after apply)

          + value_elicitation_prompt {
              + max_attempts = 2

              + message {
                  + content      = "How old are you?"
                  + content_type = "PlainText"
                }
            }
        }
      + slot {
          + description       = "Caller is calling for self or someone else"
          + name              = "aboutSelf"
          + priority          = 1
          + sample_utterances = []
          + slot_constraint   = "Required"
          + slot_type         = "staging_as_en_yes_no"
          + slot_type_version = (known after apply)

          + value_elicitation_prompt {
              + max_attempts = 2

              + message {
                  + content      = <<-EOT
                        Welcome. To help us better serve you, please answer the following questions.
                        
                        Are you calling about yourself? Please answer Yes or No.
                    EOT
                  + content_type = "PlainText"
                }
            }
        }
      + slot {
          + description       = "Caller's gender"
          + name              = "gender"
          + priority          = 3
          + sample_utterances = []
          + slot_constraint   = "Required"
          + slot_type         = "staging_as_en_gender"
          + slot_type_version = (known after apply)

          + value_elicitation_prompt {
              + max_attempts = 2

              + message {
                  + content      = "What is your gender?"
                  + content_type = "PlainText"
                }
            }
        }
    }

  # module.lex["en"].aws_lex_slot_type.this["age"] will be created
  + resource "aws_lex_slot_type" "this" {
      + checksum                 = (known after apply)
      + create_version           = false
      + created_date             = (known after apply)
      + description              = "General configs/lex/en/slot_types Age Slot Type"
      + id                       = (known after apply)
      + last_updated_date        = (known after apply)
      + name                     = "staging_as_en_age"
      + value_selection_strategy = "TOP_RESOLUTION"
      + version                  = (known after apply)

      + enumeration_value {
          + synonyms = [
              + "Prefer not to answer",
              + "Rather not say",
              + "X",
              + "prefer not",
              + "prefer not to",
            ]
          + value    = "Unknown"
        }
      + enumeration_value {
          + synonyms = [
              + "eight",
            ]
          + value    = "8"
        }
      + enumeration_value {
          + synonyms = [
              + "eighteen",
            ]
          + value    = "18"
        }
      + enumeration_value {
          + synonyms = [
              + "eighty eight",
            ]
          + value    = "88"
        }
      + enumeration_value {
          + synonyms = [
              + "eighty five",
            ]
          + value    = "85"
        }
      + enumeration_value {
          + synonyms = [
              + "eighty four",
            ]
          + value    = "84"
        }
      + enumeration_value {
          + synonyms = [
              + "eighty nine",
            ]
          + value    = "89"
        }
      + enumeration_value {
          + synonyms = [
              + "eighty one",
            ]
          + value    = "81"
        }
      + enumeration_value {
          + synonyms = [
              + "eighty seven",
            ]
          + value    = "87"
        }
      + enumeration_value {
          + synonyms = [
              + "eighty six",
            ]
          + value    = "86"
        }
      + enumeration_value {
          + synonyms = [
              + "eighty three",
            ]
          + value    = "83"
        }
      + enumeration_value {
          + synonyms = [
              + "eighty two",
            ]
          + value    = "82"
        }
      + enumeration_value {
          + synonyms = [
              + "eighty",
            ]
          + value    = "80"
        }
      + enumeration_value {
          + synonyms = [
              + "eleven",
            ]
          + value    = "11"
        }
      + enumeration_value {
          + synonyms = [
              + "fifteen",
            ]
          + value    = "15"
        }
      + enumeration_value {
          + synonyms = [
              + "fifty eight",
            ]
          + value    = "58"
        }
      + enumeration_value {
          + synonyms = [
              + "fifty five",
            ]
          + value    = "55"
        }
      + enumeration_value {
          + synonyms = [
              + "fifty four",
            ]
          + value    = "54"
        }
      + enumeration_value {
          + synonyms = [
              + "fifty nine",
            ]
          + value    = "59"
        }
      + enumeration_value {
          + synonyms = [
              + "fifty one",
            ]
          + value    = "51"
        }
      + enumeration_value {
          + synonyms = [
              + "fifty seven",
            ]
          + value    = "57"
        }
      + enumeration_value {
          + synonyms = [
              + "fifty six",
            ]
          + value    = "56"
        }
      + enumeration_value {
          + synonyms = [
              + "fifty three",
            ]
          + value    = "53"
        }
      + enumeration_value {
          + synonyms = [
              + "fifty two",
            ]
          + value    = "52"
        }
      + enumeration_value {
          + synonyms = [
              + "fifty",
            ]
          + value    = "50"
        }
      + enumeration_value {
          + synonyms = [
              + "five",
            ]
          + value    = "5"
        }
      + enumeration_value {
          + synonyms = [
              + "forty eight",
            ]
          + value    = "48"
        }
      + enumeration_value {
          + synonyms = [
              + "forty five",
            ]
          + value    = "45"
        }
      + enumeration_value {
          + synonyms = [
              + "forty four",
            ]
          + value    = "44"
        }
      + enumeration_value {
          + synonyms = [
              + "forty nine",
            ]
          + value    = "49"
        }
      + enumeration_value {
          + synonyms = [
              + "forty one",
            ]
          + value    = "41"
        }
      + enumeration_value {
          + synonyms = [
              + "forty seven",
            ]
          + value    = "47"
        }
      + enumeration_value {
          + synonyms = [
              + "forty six",
            ]
          + value    = "46"
        }
      + enumeration_value {
          + synonyms = [
              + "forty three",
            ]
          + value    = "43"
        }
      + enumeration_value {
          + synonyms = [
              + "forty two",
            ]
          + value    = "42"
        }
      + enumeration_value {
          + synonyms = [
              + "forty",
            ]
          + value    = "40"
        }
      + enumeration_value {
          + synonyms = [
              + "four",
            ]
          + value    = "4"
        }
      + enumeration_value {
          + synonyms = [
              + "fourteen",
            ]
          + value    = "14"
        }
      + enumeration_value {
          + synonyms = [
              + "nine",
            ]
          + value    = "9"
        }
      + enumeration_value {
          + synonyms = [
              + "nineteen",
            ]
          + value    = "19"
        }
      + enumeration_value {
          + synonyms = [
              + "ninety eight",
            ]
          + value    = "98"
        }
      + enumeration_value {
          + synonyms = [
              + "ninety five",
            ]
          + value    = "95"
        }
      + enumeration_value {
          + synonyms = [
              + "ninety four",
            ]
          + value    = "94"
        }
      + enumeration_value {
          + synonyms = [
              + "ninety nine",
            ]
          + value    = "99"
        }
      + enumeration_value {
          + synonyms = [
              + "ninety one",
            ]
          + value    = "91"
        }
      + enumeration_value {
          + synonyms = [
              + "ninety seven",
            ]
          + value    = "97"
        }
      + enumeration_value {
          + synonyms = [
              + "ninety six",
            ]
          + value    = "96"
        }
      + enumeration_value {
          + synonyms = [
              + "ninety three",
            ]
          + value    = "93"
        }
      + enumeration_value {
          + synonyms = [
              + "ninety two",
            ]
          + value    = "92"
        }
      + enumeration_value {
          + synonyms = [
              + "ninety",
            ]
          + value    = "90"
        }
      + enumeration_value {
          + synonyms = [
              + "one hundred",
            ]
          + value    = "100"
        }
      + enumeration_value {
          + synonyms = [
              + "one",
            ]
          + value    = "1"
        }
      + enumeration_value {
          + synonyms = [
              + "seven",
            ]
          + value    = "7"
        }
      + enumeration_value {
          + synonyms = [
              + "seventeen",
            ]
          + value    = "17"
        }
      + enumeration_value {
          + synonyms = [
              + "seventy eight",
            ]
          + value    = "78"
        }
      + enumeration_value {
          + synonyms = [
              + "seventy five",
            ]
          + value    = "75"
        }
      + enumeration_value {
          + synonyms = [
              + "seventy four",
            ]
          + value    = "74"
        }
      + enumeration_value {
          + synonyms = [
              + "seventy nine",
            ]
          + value    = "79"
        }
      + enumeration_value {
          + synonyms = [
              + "seventy one",
            ]
          + value    = "71"
        }
      + enumeration_value {
          + synonyms = [
              + "seventy seven",
            ]
          + value    = "77"
        }
      + enumeration_value {
          + synonyms = [
              + "seventy six",
            ]
          + value    = "76"
        }
      + enumeration_value {
          + synonyms = [
              + "seventy three",
            ]
          + value    = "73"
        }
      + enumeration_value {
          + synonyms = [
              + "seventy two",
            ]
          + value    = "72"
        }
      + enumeration_value {
          + synonyms = [
              + "seventy",
            ]
          + value    = "70"
        }
      + enumeration_value {
          + synonyms = [
              + "six",
            ]
          + value    = "6"
        }
      + enumeration_value {
          + synonyms = [
              + "sixteen",
            ]
          + value    = "16"
        }
      + enumeration_value {
          + synonyms = [
              + "sixty eight",
            ]
          + value    = "68"
        }
      + enumeration_value {
          + synonyms = [
              + "sixty five",
            ]
          + value    = "65"
        }
      + enumeration_value {
          + synonyms = [
              + "sixty four",
            ]
          + value    = "64"
        }
      + enumeration_value {
          + synonyms = [
              + "sixty nine",
            ]
          + value    = "69"
        }
      + enumeration_value {
          + synonyms = [
              + "sixty one",
            ]
          + value    = "61"
        }
      + enumeration_value {
          + synonyms = [
              + "sixty seven",
            ]
          + value    = "67"
        }
      + enumeration_value {
          + synonyms = [
              + "sixty six",
            ]
          + value    = "66"
        }
      + enumeration_value {
          + synonyms = [
              + "sixty three",
            ]
          + value    = "63"
        }
      + enumeration_value {
          + synonyms = [
              + "sixty two",
            ]
          + value    = "62"
        }
      + enumeration_value {
          + synonyms = [
              + "sixty",
            ]
          + value    = "60"
        }
      + enumeration_value {
          + synonyms = [
              + "ten",
            ]
          + value    = "10"
        }
      + enumeration_value {
          + synonyms = [
              + "thirteen",
            ]
          + value    = "13"
        }
      + enumeration_value {
          + synonyms = [
              + "thirty eight",
            ]
          + value    = "38"
        }
      + enumeration_value {
          + synonyms = [
              + "thirty five",
            ]
          + value    = "35"
        }
      + enumeration_value {
          + synonyms = [
              + "thirty four",
            ]
          + value    = "34"
        }
      + enumeration_value {
          + synonyms = [
              + "thirty nine",
            ]
          + value    = "39"
        }
      + enumeration_value {
          + synonyms = [
              + "thirty one",
            ]
          + value    = "31"
        }
      + enumeration_value {
          + synonyms = [
              + "thirty seven",
            ]
          + value    = "37"
        }
      + enumeration_value {
          + synonyms = [
              + "thirty six",
            ]
          + value    = "36"
        }
      + enumeration_value {
          + synonyms = [
              + "thirty three",
            ]
          + value    = "33"
        }
      + enumeration_value {
          + synonyms = [
              + "thirty two",
            ]
          + value    = "32"
        }
      + enumeration_value {
          + synonyms = [
              + "thirty",
            ]
          + value    = "30"
        }
      + enumeration_value {
          + synonyms = [
              + "three",
            ]
          + value    = "3"
        }
      + enumeration_value {
          + synonyms = [
              + "twelve",
            ]
          + value    = "12"
        }
      + enumeration_value {
          + synonyms = [
              + "twenty eight",
            ]
          + value    = "28"
        }
      + enumeration_value {
          + synonyms = [
              + "twenty five",
            ]
          + value    = "25"
        }
      + enumeration_value {
          + synonyms = [
              + "twenty four",
            ]
          + value    = "24"
        }
      + enumeration_value {
          + synonyms = [
              + "twenty nine",
            ]
          + value    = "29"
        }
      + enumeration_value {
          + synonyms = [
              + "twenty one",
            ]
          + value    = "21"
        }
      + enumeration_value {
          + synonyms = [
              + "twenty seven",
            ]
          + value    = "27"
        }
      + enumeration_value {
          + synonyms = [
              + "twenty six",
            ]
          + value    = "26"
        }
      + enumeration_value {
          + synonyms = [
              + "twenty three",
            ]
          + value    = "23"
        }
      + enumeration_value {
          + synonyms = [
              + "twenty two",
            ]
          + value    = "22"
        }
      + enumeration_value {
          + synonyms = [
              + "twenty",
            ]
          + value    = "20"
        }
      + enumeration_value {
          + synonyms = [
              + "two",
            ]
          + value    = "2"
        }
    }

  # module.lex["en"].aws_lex_slot_type.this["gender"] will be created
  + resource "aws_lex_slot_type" "this" {
      + checksum                 = (known after apply)
      + create_version           = false
      + created_date             = (known after apply)
      + description              = "General configs/lex/en/slot_types Gender Female Male Slot Type"
      + id                       = (known after apply)
      + last_updated_date        = (known after apply)
      + name                     = "staging_as_en_gender"
      + value_selection_strategy = "TOP_RESOLUTION"
      + version                  = (known after apply)

      + enumeration_value {
          + synonyms = [
              + "1",
              + "f",
              + "girl",
              + "lady",
              + "she",
              + "woman",
            ]
          + value    = "Female"
        }
      + enumeration_value {
          + synonyms = [
              + "2",
              + "boy",
              + "dude",
              + "guy",
              + "he",
              + "m",
              + "man",
            ]
          + value    = "Male"
        }
      + enumeration_value {
          + synonyms = [
              + "3",
              + "non binary",
              + "nonbinary",
              + "none",
            ]
          + value    = "Non-Binary"
        }
      + enumeration_value {
          + synonyms = [
              + "4",
              + "not answer",
              + "not answering",
              + "prefer not",
            ]
          + value    = "prefer not to answer"
        }
      + enumeration_value {
          + synonyms = [
              + "5",
              + "not sure",
              + "unsure",
              + "x",
            ]
          + value    = "Unknown"
        }
    }

  # module.lex["en"].aws_lex_slot_type.this["yes_no"] will be created
  + resource "aws_lex_slot_type" "this" {
      + checksum                 = (known after apply)
      + create_version           = false
      + created_date             = (known after apply)
      + description              = "General configs/lex/en/slot_types slot type for Yes-No kind of questions"
      + id                       = (known after apply)
      + last_updated_date        = (known after apply)
      + name                     = "staging_as_en_yes_no"
      + value_selection_strategy = "TOP_RESOLUTION"
      + version                  = (known after apply)

      + enumeration_value {
          + synonyms = [
              + "1",
              + "accept",
              + "y",
              + "ya",
              + "yah",
              + "yeah",
              + "yep",
              + "yes",
              + "yup",
            ]
          + value    = "Yes"
        }
      + enumeration_value {
          + synonyms = [
              + "2",
              + "n",
              + "nah",
              + "no",
              + "nope",
              + "not",
              + "reject",
            ]
          + value    = "No"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
